app/Controllers/Api/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `vehicle`
WHERE `location_id` = 12
---
    protected function countActiveVehicles(?int $locationId): int
    {
        $builder = $this->db->table('vehicle');
        if ($locationId) {
            $builder->where('location_id', $locationId);
        }

        return (int) $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `staff`
WHERE `user_type` = 'DRIVER'
AND   (
doj IS NULL
OR `doj` = '0000-00-00'
OR `doj` <= '2026-06-10'
 )
AND   (
resign_date IS NULL
OR `resign_date` = '0000-00-00'
OR `resign_date` >= '2026-06-10'
 )
AND `location_id` = 12
---
    protected function countActiveDrivers(string $asOfDate, ?int $locationId): int
    {
        $builder = $this->db->table('staff');
        $builder->where('user_type', 'DRIVER');

        $builder->groupStart()
            ->where('doj IS NULL', null, false)
            ->orWhere('doj', '0000-00-00')
            ->orWhere('doj <=', $asOfDate)
        ->groupEnd();

        $builder->groupStart()
            ->where('resign_date IS NULL', null, false)
            ->orWhere('resign_date', '0000-00-00')
            ->orWhere('resign_date >=', $asOfDate)
        ->groupEnd();

        if ($locationId) {
            $builder->where('location_id', $locationId);
        }

        return (int) $builder->countAllResults();