app/Controllers/Api/DriverAssignmentController.php

SELECT `s`.`id`, `s`.`name`, `s`.`staff_code`, `s`.`user_type`, `s`.`location_id`, `s`.`tel`, `s`.`doj`, `s`.`resign_date`, `l`.`location_name`
FROM `staff` `s`
LEFT JOIN `location` `l` ON `l`.`location_id` = `s`.`location_id`
WHERE `s`.`user_type` = 'DRIVER'
ORDER BY `s`.`id` ASC
---
    public function drivers()
    {
        $search = trim($this->request->getGet('search') ?? '');

        $builder = $this->db->table('staff s');
        $builder->select('s.id, s.name, s.staff_code, s.user_type, s.location_id, s.tel, s.doj, s.resign_date, l.location_name');
        $builder->join('location l', 'l.location_id = s.location_id', 'left');
        $builder->where('s.user_type', 'DRIVER');

        if ($search !== '') {
            $builder->groupStart()
                ->like('s.name', $search)
                ->orLike('s.staff_code', $search)
            ->groupEnd();
        }

        $builder->orderBy('s.id', 'ASC');
        $rows = $builder->get()->getResult();