app/Controllers/Api/LocationController.php

SELECT `location_id`, `location_name`, `location_shordname`, `opening_balance`, `radius`, `status`
FROM `location`
WHERE `status` = 'Active'
ORDER BY `location_id` ASC
---
    public function index()
    {
        $search = trim($this->request->getGet('search') ?? '');
        $status = trim($this->request->getGet('status') ?? '');

        $builder = $this->db->table('location');
        $builder->select('location_id, location_name, location_shordname, opening_balance, radius, latitude, longitude, status');

        if ($status !== '') {
            $builder->where('status', $status);
        }
        if ($search !== '') {
            $builder->groupStart()
                ->like('location_name', $search)
                ->orLike('location_shordname', $search)
            ->groupEnd();
        }

        $builder->orderBy('location_id', 'ASC');
        $rows = $builder->get()->getResult();