app/Controllers/Api/MaterialIssueController.php

SELECT *
FROM `staff`
WHERE `id` = 16
SELECT `da`.`id` AS `assignment_id`, `da`.`vehicle_no`, `da`.`driver`, `da`.`from_date`, `da`.`to_date`, `da`.`opening_hsd`, `da`.`opening_km`, `da`.`closing_hsd`, `da`.`closing_km`, `v`.`id` AS `vehicle_id`, `v`.`vehicle_no`, `v`.`location_id`, `v`.`chassis_no`, `v`.`vehicle_type`, `l`.`location_name`, `vt`.`type_name` AS `vehicle_type_name`
FROM `driver_assignment` `da`
LEFT JOIN `vehicle` `v` ON `v`.`id` = `da`.`vehicle_no`
LEFT JOIN `location` `l` ON `l`.`location_id` = `v`.`location_id`
LEFT JOIN `vehicle_types` `vt` ON `vt`.`id` = `v`.`vehicle_type`
WHERE `da`.`driver` = 16
AND (da.to_date IS NULL OR da.to_date = "0000-00-00" OR da.to_date >= CURDATE())
ORDER BY `da`.`id` DESC
---
    public function assignedVehicle()
    {
        $payload  = $this->parseRequestPayload();
        $driverId = (int) ($this->request->getGet('driver_id')
            ?? $payload['driver_id']
            ?? $payload['driver']
            ?? 0);

        if ($driverId <= 0) {
            return $this->apiError('03', 'driver_id is required.', 400);
        }

        $driver = $this->db->table('staff')->where('id', $driverId)->get()->getRow();
        if (! $driver) {
            return $this->apiError('15', 'Invalid driver.', 400);
        }

        $assignment = $this->db->table('driver_assignment da')
            ->select('da.id AS assignment_id, da.vehicle_no, da.driver, da.from_date, da.to_date,
                da.opening_hsd, da.opening_km, da.closing_hsd, da.closing_km,
                v.id AS vehicle_id, v.vehicle_no, v.location_id, v.chassis_no, v.vehicle_type,
                l.location_name, vt.type_name AS vehicle_type_name')
            ->join('vehicle v', 'v.id = da.vehicle_no', 'left')
            ->join('location l', 'l.location_id = v.location_id', 'left')
            ->join('vehicle_types vt', 'vt.id = v.vehicle_type', 'left')
            ->where('da.driver', $driverId)
            ->where('(da.to_date IS NULL OR da.to_date = "0000-00-00" OR da.to_date >= CURDATE())', null, false)
            ->orderBy('da.id', 'DESC')
            ->get()
            ->getRow();