app/Controllers/Api/StaffAdvanceController.php

    public function staffTypes()
    {
        $rows = $this->db->table('staff')
            ->select('user_type, COUNT(*) AS total')
            ->where('user_type IS NOT NULL')
            ->where('user_type !=', '')
            ->groupBy('user_type')
            ->orderBy('user_type', 'ASC')
            ->get()
            ->getResult();
---
SELECT `user_type`, COUNT(*) AS total
FROM `staff`
WHERE `user_type` IS NOT NULL
AND `user_type` != ''
GROUP BY `user_type`
ORDER BY `user_type` ASC

    public function cashPaidByUsers()
    {
        $search = trim($this->request->getGet('search') ?? '');

        $builder = $this->db->table('user');
        $builder->select('id, full_name, user_name, contact_no, email, user_type, location_id');
        $builder->where('user_type', 2);
        $builder->where('deleted_by', null);

        if ($search !== '') {
            $builder->groupStart()
                ->like('full_name', $search)
                ->orLike('user_name', $search)
                ->orLike('contact_no', $search)
            ->groupEnd();
        }

        $builder->orderBy('full_name', 'ASC');
        $rows = $builder->get()->getResult();
---
SELECT `id`, `full_name`, `user_name`, `contact_no`, `email`, `user_type`, `location_id`
FROM `user`
WHERE `user_type` = 2
AND `deleted_by` IS NULL
ORDER BY `full_name` ASC

            return $this->apiError('03', implode('; ', $errors), 400);
        }

        $staff = $this->db->table('staff s')
            ->select('s.id, s.name, s.staff_code, s.user_type, s.location_id, l.location_name')
            ->join('location l', 'l.location_id = s.location_id', 'left')
            ->where('s.id', $staffId)
            ->get()
            ->getRow();
---
SELECT `s`.`id`, `s`.`name`, `s`.`staff_code`, `s`.`user_type`, `s`.`location_id`, `l`.`location_name`
FROM `staff` `s`
LEFT JOIN `location` `l` ON `l`.`location_id` = `s`.`location_id`
WHERE `s`.`id` = 1130

    public function destroy($id = null)
    {
        $id = (int) ($id ?? 0);
        if ($id <= 0) {
            return $this->apiError('03', 'Valid advance id is required.', 400);
        }

        $existing = $this->fetchAdvanceRow($id);
        if (! $existing) {
            return $this->apiError('04', 'Staff advance not found.', 404);
        }

        $snapshot = $this->formatAdvance($existing);

        $this->db->table('staff_advance')->where('id', $id)->delete();
---
DELETE FROM `staff_advance`
WHERE `id` = 109986

    protected function fetchAdvanceRow(int $id): ?object
    {
        return $this->db->table('staff_advance sa')
            ->select('sa.*, s.name AS staff_name, s.staff_code, s.user_type, l.location_name')
            ->join('staff s', 's.id = sa.staff_id', 'left')
            ->join('location l', 'l.location_id = sa.location_id', 'left')
            ->where('sa.id', $id)
            ->get()
            ->getRow();
---
SELECT `sa`.*, `s`.`name` AS `staff_name`, `s`.`staff_code`, `s`.`user_type`, `l`.`location_name`
FROM `staff_advance` `sa`
LEFT JOIN `staff` `s` ON `s`.`id` = `sa`.`staff_id`
LEFT JOIN `location` `l` ON `l`.`location_id` = `sa`.`location_id`
WHERE `sa`.`id` = 109986