app/Filters/ApiAuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        ApiAuthContext::clear();

        $header = $request->getHeaderLine('Authorization');
        if ($header === '' || ! preg_match('/^Bearer\s+(\S+)$/i', $header, $matches)) {
            return $this->unauthorized('05', 'Authorization Bearer token is required.');
        }

        $plainToken = $matches[1];
        $tokenModel = new ApiTokenModel();
        $tokenRow   = $tokenModel->findValidByPlainToken($plainToken);

        if (! $tokenRow) {
            $existing = $tokenModel->where('token_hash', $tokenModel->hashToken($plainToken))->first();
---
SELECT *
FROM `api_tokens`
WHERE `token_hash` = '1e99ea978b4e2b5769accdf7c4f7d569379ed98588b677e0e2305eaae9aefdcd'
 LIMIT 1