app/Models/AdminModel.php

    function tonnage_dtls()
    {
        $builder = $this->db->table('tonnage');
        $builder->select('tonnage.*, created_by_user.full_name AS created_by_name, updated_by_user.full_name AS updated_by_name');
        $builder->join('user AS created_by_user', 'created_by_user.id = tonnage.created_by', 'left');
        $builder->join('user AS updated_by_user', 'updated_by_user.id = tonnage.updated_by', 'left');
        $builder->where('tonnage.deleted_by', null);
        return $builder->get()->getResult();
---
SELECT `tonnage`.*, `created_by_user`.`full_name` AS `created_by_name`, `updated_by_user`.`full_name` AS `updated_by_name`
FROM `tonnage`
LEFT JOIN `user` AS `created_by_user` ON `created_by_user`.`id` = `tonnage`.`created_by`
LEFT JOIN `user` AS `updated_by_user` ON `updated_by_user`.`id` = `tonnage`.`updated_by`
WHERE `tonnage`.`deleted_by` IS NULL

    function single_set($id)
    {
        $builder = $this->db->table('set_master');
        $builder->select('*');
        $builder->where('id', $id);
        return $builder->get()->getRow();
---
SELECT *
FROM `set_master`
WHERE `id` = '6'

    function all_tonnage()
    {
        $builder = $this->db->table('tonnage');
        $builder->select('tonnage.*, created_by_user.full_name AS created_by_name, updated_by_user.full_name AS updated_by_name, set_master.set_name');
        $builder->join('user AS created_by_user', 'created_by_user.id = tonnage.created_by', 'left');
        $builder->join('user AS updated_by_user', 'updated_by_user.id = tonnage.updated_by', 'left');
        $builder->join('set_master', 'set_master.id = tonnage.set_id', 'left');
        $builder->where('tonnage.deleted_by', null);
        $builder->where('set_master.deleted_by', null);
        $builder->orderBy('set_master.set_name', 'ASC');
        $builder->orderBy('tonnage.min', 'ASC');
        return $builder->get()->getResult();
---
SELECT `tonnage`.*, `created_by_user`.`full_name` AS `created_by_name`, `updated_by_user`.`full_name` AS `updated_by_name`, `set_master`.`set_name`
FROM `tonnage`
LEFT JOIN `user` AS `created_by_user` ON `created_by_user`.`id` = `tonnage`.`created_by`
LEFT JOIN `user` AS `updated_by_user` ON `updated_by_user`.`id` = `tonnage`.`updated_by`
LEFT JOIN `set_master` ON `set_master`.`id` = `tonnage`.`set_id`
WHERE `tonnage`.`set_id` = '7'
AND `tonnage`.`deleted_by` IS NULL
ORDER BY `tonnage`.`min` ASC

    function sets_with_range_count()
    {
        $builder = $this->db->table('set_master');
        $builder->select('set_master.*, COUNT(tonnage.id) AS range_count');
        $builder->join('tonnage', 'tonnage.set_id = set_master.id AND tonnage.deleted_by IS NULL', 'left');
        $builder->where('set_master.deleted_by', null);
        $builder->groupBy('set_master.id');
        $builder->orderBy('set_master.set_name', 'ASC');
        return $builder->get()->getResult();
---
SELECT *
FROM `set_master`
WHERE `deleted_by` IS NULL
ORDER BY `set_name` ASC

	function Getvehicle()
	{
		$builder = $this->db->table('vehicle');
		$builder->select('*');
		return $builder->get()->getResult();
---
SELECT *
FROM `vehicle`

	function userdata($user_id)
	{
		$builder = $this->db->table('user');
		$builder->select('*');
		$builder->where('id', $user_id);
		return $builder->get()->getResult();
---
SELECT *
FROM `user`
WHERE `id` = '1'

    function doregistration_dtls1($from_date = null, $to_date = null, $voucher_id = null)
    {
        $builder = $this->db->table('do_registration');
        $builder->select('do_registration.*, vendor.name as party_name');
        $builder->join('vendor', 'vendor.id = do_registration.party', 'left');

        if (!empty($voucher_id)) {
            $builder->join('despatch', 'despatch.do_no = do_registration.do_registration_id');
            $builder->where('despatch.voucher_id', $voucher_id);
            $builder->groupBy('do_registration.do_registration_id'); // Ensure unique DOs
        } else {
             // Only apply date filter if NO voucher is selected
            if (!empty($from_date) && !empty($to_date)) {
                $builder->groupStart()
                        ->where("do_registration.from_date BETWEEN '$from_date' AND '$to_date'")
                        ->orWhere("do_registration.to_date BETWEEN '$from_date' AND '$to_date'")
                        ->orWhere("(do_registration.from_date <= '$from_date' AND do_registration.to_date >= '$to_date')")
                        ->groupEnd();
            }
        }

        $builder->orderBy('do_registration_id', 'DESC');
        return $builder->get()->getResult();
---
SELECT `do_registration`.*, `vendor`.`name` as `party_name`
FROM `do_registration`
LEFT JOIN `vendor` ON `vendor`.`id` = `do_registration`.`party`
JOIN `despatch` ON `despatch`.`do_no` = `do_registration`.`do_registration_id`
WHERE `despatch`.`voucher_id` = '3'
GROUP BY `do_registration`.`do_registration_id`
ORDER BY `do_registration_id` DESC

    public function getVouchersForDeposit($from_date = null, $to_date = null, $party = null, $voucher_no = null)
    {
        $builder = $this->db->table('voucher');
        // Using MAX(vendor.name) to get a party name even if multiple despatches exist (they should have the same party now)
        $builder->select('voucher.*, SUM(despatch.net_amount) as total_net_amount, COUNT(despatch.despatch_id) as challan_count, MAX(vendor.name) as party_name');

        // Using LEFT JOINs to ensure we see the voucher even if some links are missing (though they shouldn't be)
        $builder->join('despatch', 'despatch.voucher_id = voucher.id', 'left');
    $builder->join('do_registration', 'despatch.do_no = do_registration.do_registration_id', 'left');
    // Using a more robust join that handles both numeric IDs and "Name (ID)" formatted strings
    $builder->join('vendor', 'vendor.id = do_registration.party OR vendor.id = SUBSTRING_INDEX(SUBSTRING_INDEX(do_registration.party, "(", -1), ")", 1)', 'left');

        if ($from_date && $to_date) {
             $builder->where('despatch.des_date >=', $from_date);
             $builder->where('despatch.des_date <=', $to_date);
        }

        if ($party) {
            $builder->where('do_registration.party', $party);
        }

        if ($voucher_no) {
            $builder->like('voucher.group_code', $voucher_no);
        }

        $builder->groupBy('voucher.id');
        $builder->orderBy('voucher.id', 'DESC');
        return $builder->get()->getResult();
---
SELECT `do_registration`.*, `vendor`.`name` as `party_name`
FROM `do_registration`
LEFT JOIN `vendor` ON `vendor`.`id` = `do_registration`.`party`
WHERE   (
`do_registration`.`from_date` BETWEEN '2026-01-25' AND '2026-05-31'
OR `do_registration`.`to_date` BETWEEN '2026-01-25' AND '2026-05-31'
OR (`do_registration`.`from_date` <= '2026-01-25' AND `do_registration`.`to_date` >= '2026-05-31')
 )
ORDER BY `do_registration_id` DESC