app/Models/AdminModel.php

SELECT *
FROM `settingg`
WHERE `settingg_id` = 1
---
	function Settingdata()
	{
		$builder = $this->db->table('settingg');
		$builder->select('*');
		$builder->where('settingg_id', 1);
		return $builder->get()->getResult();

SELECT `staff`.*, `location`.`location_name`
FROM `staff`
LEFT JOIN `location` ON `location`.`location_id` = `staff`.`address`
---
	function Getallstaf()
	{
	    $builder = $this->db->table('staff');
		$builder->select('staff.*,location.location_name');
		$builder->join('location', 'location.location_id = staff.address','left');
		return $builder->get()->getResult();

SELECT `driver_assignment`.*, `vehicle`.`vehicle_no` as `vehicle_number`, `staff`.`name` as `driver_name`, `staff`.`staff_code` as `driver_code`
FROM `driver_assignment`
LEFT JOIN `vehicle` ON `vehicle`.`id` = `driver_assignment`.`vehicle_no`
LEFT JOIN `staff` ON `staff`.`id` = `driver_assignment`.`driver`
WHERE `driver_assignment`.`from_date` <= '2026-03-12'
AND `driver_assignment`.`to_date` >= '2026-03-01'
OR `driver_assignment`.`to_date` IS NULL
---
public function driverasignment($from_date = null, $to_date = null)
{
    $builder = $this->db->table('driver_assignment');
    $builder->select('driver_assignment.*, vehicle.vehicle_no as vehicle_number, staff.name as driver_name, staff.staff_code as driver_code');
    $builder->join('vehicle', 'vehicle.id = driver_assignment.vehicle_no', 'left');
    $builder->join('staff', 'staff.id = driver_assignment.driver', 'left');

    if (!empty($from_date) && !empty($to_date)) {
        $builder->where('driver_assignment.from_date <=', $to_date);
        $builder->where('driver_assignment.to_date >=', $from_date);
        $builder->orWhere('driver_assignment.to_date IS NULL');
    }

    return $builder->get()->getResult();

SELECT `staff`.*, `location`.`location_name`
FROM `staff`
LEFT JOIN `location` ON `location`.`location_id` = `staff`.`location_id`
---
	function singledriverasignment($asign_id)
	{
	     $builder = $this->db->table('driver_assignment');
		$builder->select('driver_assignment.*, vehicle.vehicle_no as vehicle_number, staff.name as driver_name');
		$builder->join('vehicle', 'vehicle.id = driver_assignment.vehicle_no','left');
		$builder->join('staff', 'staff.id = driver_assignment.driver','left');
		$builder->where('driver_assignment.id', $asign_id);
		return $builder->get()->getResult();

SELECT `do_registration`.*, `route`.`location_shortname`, `created_by_user`.`full_name` AS `created_by_name`, `updated_by_user`.`full_name` AS `updated_by_name`
FROM `do_registration`
LEFT JOIN `route` ON `route`.`id` = `do_registration`.`route_id`
LEFT JOIN `user` AS `created_by_user` ON `created_by_user`.`id` = `do_registration`.`created_by`
LEFT JOIN `user` AS `updated_by_user` ON `updated_by_user`.`id` = `do_registration`.`updated_by`
WHERE `do_registration`.`deleted_by` IS NULL
---
	function doregistration_dtls()
	{
		$builder = $this->db->table('do_registration');
        $builder->select('do_registration.*,route.location_shortname, created_by_user.full_name AS created_by_name, updated_by_user.full_name AS updated_by_name');
        $builder->join('route', 'route.id = do_registration.route_id', 'left');
        $builder->join('user AS created_by_user', 'created_by_user.id = do_registration.created_by', 'left');
        $builder->join('user AS updated_by_user', 'updated_by_user.id = do_registration.updated_by', 'left');
        $builder->where('do_registration.deleted_by', null);
		return $builder->get()->getResult();

SELECT *
FROM `vendor`
---
	public function partyNames(){
	    $builder= $this->db->table('vendor');
	    $builder->select('*');
        $builder->where('type', 'Party');
	    return $builder->get()->getResult();

SELECT *
FROM `do_registration`
LEFT JOIN `route` ON `route`.`id` = `do_registration`.`route_id`
WHERE `do_registration`.`do_registration_id` = '385'
---
	function dosingleregistration_dtls($doreg_id)
	{
	    $builder = $this->db->table('do_registration');
		$builder->select('*');
		$builder->join('route', 'route.id = do_registration.route_id', 'left');
		$builder->where('do_registration.do_registration_id', $doreg_id);
		return $builder->get()->getResult();

SELECT *
FROM `vehicle`
---
	function Getvehicle()
	{
		$builder = $this->db->table('vehicle');
		$builder->select('*');
		return $builder->get()->getResult();

SELECT `adjust_salary`.*, `vehicle`.`vehicle_no`
FROM `adjust_salary`
LEFT JOIN `vehicle` ON `vehicle`.`id` = `adjust_salary`.`vehicle_id`
---
    public function showadjust_salary($year = null, $month = null)
    {
        $builder = $this->db->table('adjust_salary');
        $builder->select('adjust_salary.*, vehicle.vehicle_no');
        $builder->join('vehicle', 'vehicle.id = adjust_salary.vehicle_id', 'left');

        if (!empty($year)) {
            $builder->where('YEAR(from_date)', $year);
        }
        if (!empty($month)) {
            $builder->where('MONTH(from_date)', $month);
        }
        return $builder->get()->getResult();

SELECT *
FROM `user`
WHERE `id` = '1'
---
	function userdata($user_id)
	{
		$builder = $this->db->table('user');
		$builder->select('*');
		$builder->where('id', $user_id);
		return $builder->get()->getResult();

SELECT *
FROM `user`
---
	function Customerdata()
	{
		$builder = $this->db->table('user');
		$builder->select('*');
		return $builder->get()->getResult();

SELECT `despatch`.*, `vehicle`.`vehicle_no` as `vehicle_number`, `do_registration`.`do_no` as `doreg_no`
FROM `despatch`
JOIN `vehicle` ON `vehicle`.`id`=`despatch`.`vehicle_no`
JOIN `do_registration` ON `do_registration`.`do_registration_id`=`despatch`.`do_no`
WHERE `des_date` >= '2026-02-01'
AND `des_date` <= '2026-02-20'
AND `despatch`.`deleted_by` IS NULL
---
   function despatch_dtls($from_date, $to_date)
    {
        // If $from_date is empty, set it to the first day of the current month
        if (empty($from_date)) {
            $from_date = date('Y-m-01');
        }

        // If $to_date is empty, set it to the current date
        if (empty($to_date)) {
            $to_date = date('Y-m-d');
        }

        $builder = $this->db->table('despatch');
        $builder->select('despatch.*, vehicle.vehicle_no as vehicle_number, do_registration.do_no as doreg_no');
        $builder->join('vehicle', 'vehicle.id=despatch.vehicle_no');
        $builder->join('do_registration', 'do_registration.do_registration_id=despatch.do_no');

        // Apply date filter on des_date
        $builder->where('des_date >=', $from_date);
        $builder->where('des_date <=', $to_date);
        $builder->where('despatch.deleted_by', Null);

        return $builder->get()->getResult();

SELECT `group_code`
FROM `voucher`
GROUP BY `group_code`
ORDER BY `id` DESC
---
	public function get_active_groups()
	{
		$builder = $this->db->table('voucher');
		$builder->select('group_code');
		$builder->groupBy('group_code');
		$builder->orderBy('id', 'DESC');
		return $builder->get()->getResult();

SELECT `voucher_payment`.*
FROM `voucher_payment`
ORDER BY `id` DESC
---
public function getVoucherPayments($from_date = null, $to_date = null, $party = null)
{
    $builder = $this->db->table('voucher_payment');
    $builder->select('voucher_payment.*');

    if ($from_date && $to_date) {
        $builder->where('created_at >=', $from_date . ' 00:00:00');
        $builder->where('created_at <=', $to_date . ' 23:59:59');
    }

    $records = $builder->orderBy('id', 'DESC')->get()->getResult();

SELECT `party`, `do_no`
FROM `do_registration`
WHERE `do_no` = '392'
OR `do_registration_id` = '392'
---
            $actual_do_strings = [];

            foreach($do_numbers as $d_val) {
                $do_query = $this->db->table('do_registration')
                            ->select('party, do_no')
                            ->where('do_no', $d_val)
                            ->orWhere('do_registration_id', $d_val)
                            ->get()->getRow();

SELECT `id`, `name`
FROM `vendor`
WHERE `id` = '2'
---
                         // Re-using the simplified vendor lookup for now since it was working
                         $vendor = null;
                         if (is_numeric($party_val)) {
                              $vendor = $this->db->table('vendor')->select('id, name')->where('id', $party_val)->get()->getRow();

SELECT `despatch`.*, `vehicle`.`vehicle_no` as `vehicle_number`, `do_registration`.`do_no` as `doreg_no`, `do_registration`.`rate`, `do_registration`.`shortage_qty` as `min_qty`, `do_registration`.`shortage_rate`, `do_registration`.`diesel_rate`, `do_registration`.`diesel_payment_type`, `do_registration`.`cash_type`, `do_registration`.`special_shortage`, `creator`.`full_name` as `made_by`, COALESCE(do_registration.tds_percentage, 2.00) as tds_percentage, `voucher`.`group_code`
FROM `despatch`
JOIN `vehicle` ON `vehicle`.`id` = `despatch`.`vehicle_no`
JOIN `do_registration` ON `do_registration`.`do_registration_id` = `despatch`.`do_no`
LEFT JOIN `voucher` ON `voucher`.`id` = `despatch`.`voucher_id`
LEFT JOIN `activity_logs` ON `activity_logs`.`model_id` = `despatch`.`despatch_id` AND `activity_logs`.`action` = 'create' AND (`activity_logs`.`menu` = 'despatch_entry' OR `activity_logs`.`menu` = 'insert_despatch_entry')
LEFT JOIN `user` as `creator` ON `creator`.`id` = `activity_logs`.`user_id`
WHERE `despatch`.`deleted_by` IS NULL
AND `despatch`.`voucher_id` IN ('11','12')
---
public function getChallansByDoList($do_numbers_array)
{
    if (empty($do_numbers_array)) {
        return [];
    }

    $builder = $this->db->table('despatch');
    $builder->select('despatch.*, vehicle.vehicle_no as vehicle_number, do_registration.do_no as doreg_no, do_registration.rate, do_registration.shortage_qty as min_qty, do_registration.shortage_rate, do_registration.diesel_rate, do_registration.diesel_payment_type, do_registration.cash_type, do_registration.special_shortage, creator.full_name as made_by, COALESCE(do_registration.tds_percentage, 2.00) as tds_percentage, voucher.group_code');
    $builder->join('vehicle', 'vehicle.id = despatch.vehicle_no');
    $builder->join('do_registration', 'do_registration.do_registration_id = despatch.do_no');
    $builder->join('voucher', 'voucher.id = despatch.voucher_id', 'left');
    $builder->join('activity_logs', "activity_logs.model_id = despatch.despatch_id AND activity_logs.action = 'create' AND (activity_logs.menu = 'despatch_entry' OR activity_logs.menu = 'insert_despatch_entry')", 'left');
    $builder->join('user as creator', 'creator.id = activity_logs.user_id', 'left');
    $builder->where('despatch.deleted_by IS NULL');

    // Filter by DO numbers
    // Since do_numbers in voucher_payment can match either ID or String, we should try to match both if possible,
    // but despatch.do_no is the ID from do_registration table.
    // The Input $do_numbers_array comes from the controller which should parse the strings.
    // However, in this system, it seems `despatch.do_no` is the linking key.

    // We'll assume the controller passes valid DO IDs or DO Numbers that match.
    // Wait, despatch.do_no is a foreign key to do_registration.do_registration_id.
    // The DO numbers stored in `voucher_payment` are strings (do_no column of do_registration).
    // So we need to match `do_registration.do_no` OR `do_registration.do_registration_id` against the input.

    $builder->groupEnd();

    return $builder->get()->getResult();

SELECT `despatch`.*, `vehicle`.`vehicle_no` as `vehicle_number`, `do_registration`.`do_no` as `doreg_no`, `do_registration`.`rate`, `do_registration`.`shortage_qty` as `min_qty`, `do_registration`.`shortage_rate`, `do_registration`.`diesel_rate`, `do_registration`.`diesel_payment_type`, `do_registration`.`cash_type`, `do_registration`.`special_shortage`, `creator`.`full_name` as `made_by`, COALESCE(do_registration.tds_percentage, 2.00) as tds_percentage, `voucher`.`group_code`
FROM `despatch`
JOIN `vehicle` ON `vehicle`.`id` = `despatch`.`vehicle_no`
JOIN `do_registration` ON `do_registration`.`do_registration_id` = `despatch`.`do_no`
LEFT JOIN `voucher` ON `voucher`.`id` = `despatch`.`voucher_id`
LEFT JOIN `activity_logs` ON `activity_logs`.`model_id` = `despatch`.`despatch_id` AND `activity_logs`.`action` = 'create' AND (`activity_logs`.`menu` = 'despatch_entry' OR `activity_logs`.`menu` = 'insert_despatch_entry')
LEFT JOIN `user` as `creator` ON `creator`.`id` = `activity_logs`.`user_id`
WHERE `despatch`.`deleted_by` IS NULL
AND `despatch`.`voucher_id` IN ('11','12')
---
public function getChallansByVoucherList($voucher_ids_array)
{
    if (empty($voucher_ids_array)) {
        return [];
    }

    $builder = $this->db->table('despatch');
    $builder->select('despatch.*, vehicle.vehicle_no as vehicle_number, do_registration.do_no as doreg_no, do_registration.rate, do_registration.shortage_qty as min_qty, do_registration.shortage_rate, do_registration.diesel_rate, do_registration.diesel_payment_type, do_registration.cash_type, do_registration.special_shortage, creator.full_name as made_by, COALESCE(do_registration.tds_percentage, 2.00) as tds_percentage, voucher.group_code');
    $builder->join('vehicle', 'vehicle.id = despatch.vehicle_no');
    $builder->join('do_registration', 'do_registration.do_registration_id = despatch.do_no');
    $builder->join('voucher', 'voucher.id = despatch.voucher_id', 'left');
    $builder->join('activity_logs', "activity_logs.model_id = despatch.despatch_id AND activity_logs.action = 'create' AND (activity_logs.menu = 'despatch_entry' OR activity_logs.menu = 'insert_despatch_entry')", 'left');
    $builder->join('user as creator', 'creator.id = activity_logs.user_id', 'left');
    $builder->where('despatch.deleted_by IS NULL');

    // Filter by Voucher IDs
    $builder->whereIn('despatch.voucher_id', $voucher_ids_array);

    return $builder->get()->getResult();

SELECT `despatch`.*, `do_registration`.`diesel_type` as `diesel_for_trip`, `despatch`.`quantity` as `total_weight`
FROM `despatch`
LEFT JOIN `do_registration` ON `do_registration`.`do_registration_id` = `despatch`.`do_no`
WHERE `despatch`.`vehicle_no` = '75'
AND `despatch`.`des_date` >= '2025-11-01'
AND `despatch`.`des_date` <= '2025-11-16'
---
function vehicle_disel_details($vehicle_id, $from_date = null, $to_date = null)
{
    // Set default values if $from_date or $to_date are empty or null
    if (empty($from_date)) {
        $from_date = date('Y-m-01'); // First day of the current month
    }
    if (empty($to_date)) {
        $to_date = date('Y-m-d'); // Current date
    }
    $builder = $this->db->table('despatch');
    $builder->select('despatch.*,
                      do_registration.diesel_type as diesel_for_trip,
                      despatch.quantity as total_weight
                      ');
    $builder->join('do_registration', 'do_registration.do_registration_id = despatch.do_no', 'left');
    $builder->where('despatch.vehicle_no', $vehicle_id);
    $builder->where('despatch.des_date >=', $from_date);
    $builder->where('despatch.des_date <=', $to_date);

    return $builder->get()->getResult();