app/Models/AdminModel.php

SELECT *
FROM `driver_material_issue`
WHERE `driver_id` = 14
AND `status` = 'Active'
---
    public function get_active_driver_materials($driver_id)
    {
        return $this->db->table('driver_material_issue')
            ->where('driver_id', $driver_id)
            ->where('status', 'Active')
            ->get()->getResult();

SELECT `staff`.*, `location`.`location_name`
FROM `staff`
LEFT JOIN `location` ON `location`.`location_id` = `staff`.`location_id`
WHERE `staff`.`user_type` = 'STAFF'
ORDER BY `staff`.`name` ASC
---
    function GetallDrivers()
    {
        $builder = $this->db->table('staff');
        $builder->select('staff.*, location.location_name');
        $builder->join('location', 'location.location_id = staff.location_id', 'left');
        $builder->where('staff.user_type', 'DRIVER');

        return $builder->orderBy('staff.id', 'ASC')->get()->getResult();

SELECT `staff_advance`.*, `location`.`location_name`, `staff`.`name`, `staff`.`staff_code`, `staff`.`user_type`
FROM `staff_advance`
LEFT JOIN `location` ON `location`.`location_id` = `staff_advance`.`location_id`
LEFT JOIN `staff` ON `staff`.`id` = `staff_advance`.`staff_id`
WHERE `adv_date` >= '2026-05-07'
AND `adv_date` <= '2026-05-15'
---
    function staffadvance($from_date, $to_date)
    {
        if (empty($from_date)) {
            $from_date = date('Y-m-01');

        }
        // If $to_date is empty, set it to the current date
        if (empty($to_date)) {
            $to_date = date('Y-m-d');
        }
        // echo $to_date;exit;
        $builder = $this->db->table('staff_advance');
        $builder->select('staff_advance.*, location.location_name, staff.name, staff.staff_code, staff.user_type');
        $builder->join('location', 'location.location_id = staff_advance.location_id', 'left');
        $builder->join('staff', 'staff.id = staff_advance.staff_id', 'left');
        $builder->where('adv_date >=', $from_date);
        $builder->where('adv_date <=', $to_date);
        return $builder->get()->getResult();

SELECT *
FROM `diesel_rate_master`
ORDER BY `from_date` DESC
---
    function get_diesel_rate_master($from_date = null, $to_date = null)
    {
        $builder = $this->db->table('diesel_rate_master');
        if (!empty($from_date))
            $builder->where('from_date >=', $from_date);
        if (!empty($to_date))
            $builder->where('to_date <=', $to_date);
        $builder->orderBy('from_date', 'DESC');
        return $builder->get()->getResult();

SELECT MAX(stock.stock_id) AS stock_id, MAX(stock.date) AS date, MAX(location.location_name) AS location_name, MAX(location.location_id) AS location_id, MAX(stock.invoice_number) AS invoice_number, MAX(vendor.id) AS supplier_id, MAX(vendor.name) AS supplier_name, `stock`.`stock_code`, SUM(stock.quantity) AS total_quantity, SUM(stock.gst_amount) AS total_gst_amount, MAX(stock.bill_photo) AS bill_photo, MAX(stock.remarks) AS remarks
FROM `stock`
LEFT JOIN `items` ON `items`.`id` = `stock`.`sproduct_id`
LEFT JOIN `units` ON `units`.`unit_id` = `items`.`unit_id`
LEFT JOIN `location` ON `location`.`location_id` = `stock`.`location_id`
LEFT JOIN `vendor` ON `vendor`.`id` = `stock`.`supplier_id`
WHERE `stock`.`stock_code` = 572
GROUP BY stock.stock_code, CASE WHEN stock.invoice_number LIKE 'stock-trans%' THEN '' ELSE COALESCE(stock.invoice_number, '') END, CASE WHEN stock.invoice_number LIKE 'stock-trans%' THEN '1970-01-01' ELSE stock.date END
ORDER BY MAX(stock.date) DESC
SELECT `stock`.*, `items`.`item_name`, `items`.`item_id`, `vendor`.`name`, `units`.`unit_name`
FROM `stock`
LEFT JOIN `items` ON `items`.`id` = `stock`.`sproduct_id`
LEFT JOIN `units` ON `units`.`unit_id` = `items`.`unit_id`
LEFT JOIN `vendor` ON `vendor`.`id` = `stock`.`supplier_id`
WHERE `stock_code` = 572
ORDER BY `date` DESC
---
    function singleStock($invoiceno)
    {
        $builder = $this->db->table('stock');
        $builder->select('stock.*,items.item_name, items.item_id,vendor.name,units.unit_name');
        $builder->join('items', 'items.id = stock.sproduct_id', 'left');
        $builder->join('units', 'units.unit_id = items.unit_id', 'left');
        $builder->join('vendor', 'vendor.id = stock.supplier_id', 'left');
        $builder->where('stock_code', $invoiceno);
        $builder->orderBy('date', 'DESC');
        return $builder->get()->getResult();

SELECT *
FROM `vehicle`
---
    function Getvehicle()
    {
        $builder = $this->db->table('vehicle');
        $builder->select('*');
        return $builder->get()->getResult();

SELECT *
FROM `user`
WHERE `id` = '2225'
---
    function userdata($user_id)
    {
        $builder = $this->db->table('user');
        $builder->select('*');
        $builder->where('id', $user_id);
        return $builder->get()->getResult();

SELECT `t`.*, `u`.`full_name` as `assigned_by_name`
FROM `tasks` `t`
LEFT JOIN `user` `u` ON `u`.`id` = `t`.`assigned_by`
WHERE FIND_IN_SET(2225, t.assigned_to) > 0
ORDER BY `t`.`id` DESC
---
    public function getTasksByUser($user_id)
    {
        $uid = (int) $user_id;
        $tasks = $this->db->table('tasks t')
            ->select('t.*, u.full_name as assigned_by_name')
            ->join('user u', 'u.id = t.assigned_by', 'left')
            ->where("FIND_IN_SET({$uid}, t.assigned_to) > 0", null, false)
            ->orderBy('t.id', 'DESC')
            ->get()->getResult();

SELECT `id`, `full_name`
FROM `user`
WHERE `id` IN (2225,2248)
---
    private function resolveTaskUserNames(array $tasks): array
    {
        if (empty($tasks)) return [];

        // Collect all user IDs referenced across all tasks
        $allIds = [];
        foreach ($tasks as $t) {
            foreach (array_filter(array_map('intval', explode(',', (string)($t->assigned_to ?? '')))) as $id) $allIds[$id] = true;
            foreach (array_filter(array_map('intval', explode(',', (string)($t->cc         ?? '')))) as $id) $allIds[$id] = true;
        }

        // Fetch all needed users in one query
        $userMap = [];
        if (!empty($allIds)) {
            $rows = $this->db->table('user')->select('id, full_name')->whereIn('id', array_keys($allIds))->get()->getResult();