app/Models/ApiTokenModel.php

INSERT INTO `api_tokens` (`user_id`, `token_hash`, `device_id`, `expires_at`, `created_at`) VALUES (2246, '590fae2407660041310067f27c41fa8189e75be0713bc6f691cf2733691f0a5b', NULL, '2026-07-10 06:34:06', '2026-06-10 06:34:06')
---
    public function createForUser(int $userId, ?string $deviceId = null): array
    {
        $config = config(ApiConfig::class);
        $plainToken = bin2hex(random_bytes(32));
        $expiresAt  = date('Y-m-d H:i:s', strtotime('+' . $config->tokenTtlDays . ' days'));

        if ($config->maxTokensPerUser > 0) {
            $this->enforceTokenLimit($userId, $config->maxTokensPerUser);
        }

        $this->insert([
            'user_id'    => $userId,
            'token_hash' => $this->hashToken($plainToken),
            'device_id'  => $deviceId,
            'expires_at' => $expiresAt,
            'created_at' => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `api_tokens`
WHERE `token_hash` = '4e3c5659fe8f2750dd89e54d3af08bf97a757fd374eec4ff745f1cdeb78b6101'
AND `revoked_at` IS NULL
AND `expires_at` > '2026-06-09 06:43:53'
 LIMIT 1
---
    public function findValidByPlainToken(string $plainToken): ?object
    {
        if ($plainToken === '') {
            return null;
        }

        $row = $this->where('token_hash', $this->hashToken($plainToken))
            ->where('revoked_at', null)
            ->where('expires_at >', date('Y-m-d H:i:s'))
            ->first();

UPDATE `api_tokens` SET `last_used_at` = '2026-06-09 06:43:53'
WHERE `api_tokens`.`id` IN (110)
---
    public function touchLastUsed(int $tokenId): void
    {
        $this->update($tokenId, ['last_used_at' => date('Y-m-d H:i:s')]);

SELECT *
FROM `api_tokens`
WHERE `user_id` = 2246
AND `revoked_at` IS NULL
AND `expires_at` > '2026-06-10 06:34:06'
ORDER BY `created_at` ASC
UPDATE `api_tokens` SET `revoked_at` = '2026-06-10 06:34:06'
WHERE `api_tokens`.`id` IN ('129')
---
    protected function enforceTokenLimit(int $userId, int $maxTokens): void
    {
        $active = $this->where('user_id', $userId)
            ->where('revoked_at', null)
            ->where('expires_at >', date('Y-m-d H:i:s'))
            ->orderBy('created_at', 'ASC')
            ->findAll();

        $overflow = count($active) - $maxTokens + 1;
        if ($overflow < 1) {
            return;
        }

        foreach (array_slice($active, 0, $overflow) as $token) {
            $this->update($token->id, ['revoked_at' => date('Y-m-d H:i:s')]);